In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    "name":['albin','benny','john'],
    "age":[18,19,45],
    "city":['kannur','kerala','india']

}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

    name  age    city
0  albin   18  kannur
1  benny   19  kerala
2   john   45   india

In [6]:
df.to_csv('friends.csv')

In [7]:
df.tail(2)

    name  age    city
1  benny   19  kerala
2   john   45   india

In [8]:
df.head(2)

    name  age    city
0  albin   18  kannur
1  benny   19  kerala

In [9]:
bank = pd.read_csv(r"C:\Users\Anasiya\Desktop\Pandas\bank_data.csv")

In [10]:
bank

,id,expected_recovery_amount,actual_recovery_amount,recovery_strategy,age,sex
0,2030,194,263.540000,Level 0 Recovery,19,Male
1,1150,486,416.090000,Level 0 Recovery,25,Female
2,380,527,429.350000,Level 0 Recovery,27,Male
3,1838,536,296.990000,Level 0 Recovery,25,Male
4,1995,541,346.385000,Level 0 Recovery,34,Male
...,...,...,...,...,...,...
1877,361,9785,15388.195990,Level 4 Recovery,65,Female
1878,196,9857,9709.909257,Level 4 Recovery,68,Female
1879,313,9859,30209.181790,Level 4 Recovery,58,Female
1880,1781,9920,20386.232190,Level 4 Recovery,67,Female
1881,522,9964,16706.305920,Level 4 Recovery,53,Male

In [11]:
bank['id']

0       2030
1       1150
2        380
3       1838
4       1995
        ...
1877     361
1878     196
1879     313
1880    1781
1881     522
Name: id, Length: 1882, dtype: int64

In [12]:
bank['id'][0]

2030

In [13]:
bank['id'][0]=456

C:\Users\Anasiya\AppData\Local\Temp\ipykernel_18344\1694027515.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bank['id'][0]=456

In [14]:
bank

,id,expected_recovery_amount,actual_recovery_amount,recovery_strategy,age,sex
0,456,194,263.540000,Level 0 Recovery,19,Male
1,1150,486,416.090000,Level 0 Recovery,25,Female
2,380,527,429.350000,Level 0 Recovery,27,Male
3,1838,536,296.990000,Level 0 Recovery,25,Male
4,1995,541,346.385000,Level 0 Recovery,34,Male
...,...,...,...,...,...,...
1877,361,9785,15388.195990,Level 4 Recovery,65,Female
1878,196,9857,9709.909257,Level 4 Recovery,68,Female
1879,313,9859,30209.181790,Level 4 Recovery,58,Female
1880,1781,9920,20386.232190,Level 4 Recovery,67,Female
1881,522,9964,16706.305920,Level 4 Recovery,53,Male

In [15]:
bank.to_csv('bank.csv ')

In [16]:

ser = pd.Series(np.random.rand(34))

In [17]:
ser

0     0.609566
1     0.749787
2     0.763775
3     0.586002
4     0.948425
5     0.758579
6     0.585318
7     0.413645
8     0.867689
9     0.816494
10    0.196663
11    0.123068
12    0.325498
13    0.480819
14    0.281480
15    0.780828
16    0.342841
17    0.116898
18    0.498726
19    0.973389
20    0.200499
21    0.535066
22    0.807092
23    0.580618
24    0.723621
25    0.644168
26    0.608181
27    0.619678
28    0.642981
29    0.536964
30    0.587162
31    0.432057
32    0.875924
33    0.906412
dtype: float64

In [18]:
type(ser)

pandas.core.series.Series

In [19]:
newdf = pd.DataFrame(np.random.rand(334,5))

In [20]:
newdf

            0         1         2         3         4
0    0.199663  0.608743  0.005427  0.239250  0.493729
1    0.274850  0.037840  0.732906  0.113665  0.874211
2    0.756390  0.574055  0.332435  0.867060  0.929865
3    0.176153  0.667018  0.708786  0.462070  0.965813
4    0.079803  0.417602  0.995492  0.075224  0.078876
..        ...       ...       ...       ...       ...
329  0.984802  0.924014  0.193651  0.372951  0.444402
330  0.852479  0.435384  0.824622  0.815995  0.904859
331  0.552864  0.425348  0.096079  0.499548  0.881531
332  0.908904  0.525531  0.331774  0.072773  0.796910
333  0.581620  0.105362  0.143680  0.035549  0.442052

[334 rows x 5 columns]

In [21]:
newdf.head()

          0         1         2         3         4
0  0.199663  0.608743  0.005427  0.239250  0.493729
1  0.274850  0.037840  0.732906  0.113665  0.874211
2  0.756390  0.574055  0.332435  0.867060  0.929865
3  0.176153  0.667018  0.708786  0.462070  0.965813
4  0.079803  0.417602  0.995492  0.075224  0.078876

In [22]:
type(newdf)

pandas.core.frame.DataFrame

In [24]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.514116    0.465011    0.479963    0.510051    0.508746
std      0.284709    0.286884    0.285658    0.294773    0.293621
min      0.000030    0.002635    0.004132    0.007268    0.006116
25%      0.281849    0.211866    0.224409    0.264215    0.251468
50%      0.505641    0.446031    0.482951    0.501538    0.518851
75%      0.756057    0.698133    0.714747    0.750932    0.768839
max      0.998992    0.998451    0.997125    0.995438    0.991835

In [26]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [27]:
newdf[0][0]

0.19966285794119276

In [28]:
newdf[0][0] = "albi"

In [29]:
newdf.head()

          0         1         2         3         4
0      albi  0.608743  0.005427  0.239250  0.493729
1   0.27485  0.037840  0.732906  0.113665  0.874211
2   0.75639  0.574055  0.332435  0.867060  0.929865
3  0.176153  0.667018  0.708786  0.462070  0.965813
4  0.079803  0.417602  0.995492  0.075224  0.078876

In [31]:
newdf.index

RangeIndex(start=0, stop=334, step=1)

In [33]:
newdf.to_numpy()

array([['albi', 0.6087433488765281, 0.0054274271861722845,
        0.23924986299734985, 0.49372867853147673],
       [0.2748500858473615, 0.037839840517533974, 0.732906070478381,
        0.113664754001355, 0.8742107383738192],
       [0.7563895829869722, 0.5740553639181178, 0.33243538831255937,
        0.8670601024982513, 0.9298652672872083],
       ...,
       [0.5528640291665008, 0.4253480906832324, 0.09607875927795106,
        0.49954803027352024, 0.8815313176058587],
       [0.908903846525295, 0.5255307743171513, 0.33177351823256374,
        0.07277344647138417, 0.7969104175773476],
       [0.5816202200736411, 0.10536213373935865, 0.14367965328761723,
        0.03554914875845039, 0.44205172684999805]], dtype=object)

In [34]:
newdf[0][0] = 0.8

In [35]:
newdf

            0         1         2         3         4
0         0.8  0.608743  0.005427  0.239250  0.493729
1     0.27485  0.037840  0.732906  0.113665  0.874211
2     0.75639  0.574055  0.332435  0.867060  0.929865
3    0.176153  0.667018  0.708786  0.462070  0.965813
4    0.079803  0.417602  0.995492  0.075224  0.078876
..        ...       ...       ...       ...       ...
329  0.984802  0.924014  0.193651  0.372951  0.444402
330  0.852479  0.435384  0.824622  0.815995  0.904859
331  0.552864  0.425348  0.096079  0.499548  0.881531
332  0.908904  0.525531  0.331774  0.072773  0.796910
333   0.58162  0.105362  0.143680  0.035549  0.442052

[334 rows x 5 columns]

In [36]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.8,0.27485,0.75639,0.176153,0.079803,0.175793,0.907319,0.843825,0.624552,0.689862,...,0.402612,0.829765,0.332224,0.223635,0.167916,0.984802,0.852479,0.552864,0.908904,0.58162
1,0.608743,0.03784,0.574055,0.667018,0.417602,0.766399,0.653393,0.106644,0.033599,0.518973,...,0.25201,0.035568,0.202493,0.654033,0.070357,0.924014,0.435384,0.425348,0.525531,0.105362
2,0.005427,0.732906,0.332435,0.708786,0.995492,0.02733,0.979163,0.814531,0.481414,0.244072,...,0.247571,0.997125,0.392299,0.358473,0.665622,0.193651,0.824622,0.096079,0.331774,0.14368
3,0.23925,0.113665,0.86706,0.46207,0.075224,0.353879,0.191326,0.969859,0.159535,0.40691,...,0.485092,0.435965,0.623315,0.333793,0.262,0.372951,0.815995,0.499548,0.072773,0.035549
4,0.493729,0.874211,0.929865,0.965813,0.078876,0.713458,0.397641,0.919497,0.256103,0.667208,...,0.289424,0.934385,0.690316,0.385113,0.320296,0.444402,0.904859,0.881531,0.79691,0.442052

In [37]:
newdf.head()

          0         1         2         3         4
0       0.8  0.608743  0.005427  0.239250  0.493729
1   0.27485  0.037840  0.732906  0.113665  0.874211
2   0.75639  0.574055  0.332435  0.867060  0.929865
3  0.176153  0.667018  0.708786  0.462070  0.965813
4  0.079803  0.417602  0.995492  0.075224  0.078876

In [41]:
newdf.sort_index(axis=1,ascending=False)

            4         3         2         1         0
0    0.493729  0.239250  0.005427  0.608743       0.8
1    0.874211  0.113665  0.732906  0.037840   0.27485
2    0.929865  0.867060  0.332435  0.574055   0.75639
3    0.965813  0.462070  0.708786  0.667018  0.176153
4    0.078876  0.075224  0.995492  0.417602  0.079803
..        ...       ...       ...       ...       ...
329  0.444402  0.372951  0.193651  0.924014  0.984802
330  0.904859  0.815995  0.824622  0.435384  0.852479
331  0.881531  0.499548  0.096079  0.425348  0.552864
332  0.796910  0.072773  0.331774  0.525531  0.908904
333  0.442052  0.035549  0.143680  0.105362   0.58162

[334 rows x 5 columns]

In [42]:
newdf.head()

          0         1         2         3         4
0       0.8  0.608743  0.005427  0.239250  0.493729
1   0.27485  0.037840  0.732906  0.113665  0.874211
2   0.75639  0.574055  0.332435  0.867060  0.929865
3  0.176153  0.667018  0.708786  0.462070  0.965813
4  0.079803  0.417602  0.995492  0.075224  0.078876

In [43]:
newdf[0]

0           0.8
1       0.27485
2       0.75639
3      0.176153
4      0.079803
         ...
329    0.984802
330    0.852479
331    0.552864
332    0.908904
333     0.58162
Name: 0, Length: 334, dtype: object

In [44]:
type(newdf[0])

pandas.core.series.Series

In [46]:
newdf2 = newdf

In [47]:
newdf2

            0         1         2         3         4
0         0.8  0.608743  0.005427  0.239250  0.493729
1     0.27485  0.037840  0.732906  0.113665  0.874211
2     0.75639  0.574055  0.332435  0.867060  0.929865
3    0.176153  0.667018  0.708786  0.462070  0.965813
4    0.079803  0.417602  0.995492  0.075224  0.078876
..        ...       ...       ...       ...       ...
329  0.984802  0.924014  0.193651  0.372951  0.444402
330  0.852479  0.435384  0.824622  0.815995  0.904859
331  0.552864  0.425348  0.096079  0.499548  0.881531
332  0.908904  0.525531  0.331774  0.072773  0.796910
333   0.58162  0.105362  0.143680  0.035549  0.442052

[334 rows x 5 columns]

In [48]:
newdf3 = newdf.copy()

In [49]:
newdf

            0         1         2         3         4
0         0.8  0.608743  0.005427  0.239250  0.493729
1     0.27485  0.037840  0.732906  0.113665  0.874211
2     0.75639  0.574055  0.332435  0.867060  0.929865
3    0.176153  0.667018  0.708786  0.462070  0.965813
4    0.079803  0.417602  0.995492  0.075224  0.078876
..        ...       ...       ...       ...       ...
329  0.984802  0.924014  0.193651  0.372951  0.444402
330  0.852479  0.435384  0.824622  0.815995  0.904859
331  0.552864  0.425348  0.096079  0.499548  0.881531
332  0.908904  0.525531  0.331774  0.072773  0.796910
333   0.58162  0.105362  0.143680  0.035549  0.442052

[334 rows x 5 columns]

In [51]:
newdf.columns = list("ABCDE")

In [52]:
newdf

            A         B         C         D         E
0         0.8  0.608743  0.005427  0.239250  0.493729
1     0.27485  0.037840  0.732906  0.113665  0.874211
2     0.75639  0.574055  0.332435  0.867060  0.929865
3    0.176153  0.667018  0.708786  0.462070  0.965813
4    0.079803  0.417602  0.995492  0.075224  0.078876
..        ...       ...       ...       ...       ...
329  0.984802  0.924014  0.193651  0.372951  0.444402
330  0.852479  0.435384  0.824622  0.815995  0.904859
331  0.552864  0.425348  0.096079  0.499548  0.881531
332  0.908904  0.525531  0.331774  0.072773  0.796910
333   0.58162  0.105362  0.143680  0.035549  0.442052

[334 rows x 5 columns]